#Область ПрограммныйИнтерфейс

Процедура ДополнитьФормыДокументов(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
		
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);	
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	КонецЕсли
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)   
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		ПолеВВода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
		ПолеВВода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВВода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо"; 
	КонецЕсли;
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) 
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		ПолеВВода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.Ответственный);
		ПолеВВода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВВода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо"; 
	КонецЕсли;
КонецПроцедуры  


#КонецОбласти